// ================================================================================================ 
// 文件名称：Usart.H  
// 芯片类型: STM32F103VBT6                                           
// 开发软件: Keil, Windows XP2 
// 开发时间：2010年01月14日                                                               
// 程序功能：STM32串口程序
// 编写人员：崔超                                                                       
// 联系方式：13686036830  cuichao@xrd-lcd.com   
// ================================================================================================
#ifndef __Usart_H_
#define __Usart_H_
void USART1_IRQHandler(void);
void USART3_IRQHandler(void);

#endif
/******************************************************************************/
