//================================================================================================
// 文件名称: main.c 
// 芯片类型: STM32103RBT6                                            
// 开发软件: Keil v3.90, Windows XP2 
// 开发时间: 2010年01月05日                                                               
// 程序功能: 
// 编写人员: 崔超                                                                       
// 联系方式: 13686036830  soulcoffee@sohu.com   
//================================================================================================ 

//========================================= 头文件 ================================================ 	
#include "config.h"

//======================================== 变量定义 =============================================== 
INT8S TestStr1[]= "!#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~" ;   
INT8S TestStr2[]="深圳市欣瑞达电子有限公司成立于1997年12月，专业从事液晶显示模块的研发、生产、销售,并提供全套液晶显示技术方案。公司是韩国LG Display中国区域授权总代理、台湾晶采光电(AMPIRE CO.,LTD.)大陆指定\
代理商." ;                 
//============================================================================= 
//函 数 名: main() 
//功    能: C入口函数  
//入口参数: 无
//出口参数: 无
//返 回 值: 无
//============================================================================= 
int main (void)
{ 				 

	SystemInit();  
  	TargetResetInit(); //目标板基本初始化
   
  	GUI_Initialize();// 初始化LCM 
	GUI_FillSCR(0xff);
   Delay_ms(1000);
   	GUI_FillSCR(0x00);
   Delay_ms(1000);

	while(1)
	{
	 GUI_ClearSCR();
	 GUI_SetEnFont(En_8x8);
	 GUI_DispString(TestStr1,0,0);
	 GUI_DispString("相对坐标:",0,128);
	 GUI_DispString(TestStr1,0,48);
	 GUI_DispDec(65535,0,143,5);
	 Display_SignedNumber(-5535,40,143,4);
	 Delay_s(5);
	 GUI_SetTextMode(GUI_TEXTMODE_UNDERLINE);
	 GUI_DispString(TestStr2,0,0);
	 Delay_s(5);
     GUI_ClearSCR();
     GUI_Line(0,0,50,60,1);
     Delay_s(5);
	}

}

//================================================================================================= 
//                                   0ooo
//                          ooo0     (   ) 
//                          (   )     ) /
//                           \ (     (_/
//                            \_) 
//================================================================================================= 
