/**********************************************************************************************
***模块名称： T6963DRV_MO.C                                                                 ***
***模块功能： 基于T6963控制芯片LCM240128驱动                                                ***																				                       
***作    者： METAL MAX（liyangbbs@126.com）                                                ***
***调用方式：                                                                               ***
***日    志： 日期        版本    修改人      事件                                          ***
***           2007/9/13   V1.00   METAL MAX   搭建程序框架                                  ***
***           2007/9/14   V1.01   METAL MAX   具体底层程序添加                              ***
***           2007/9/15   V1.02   METAL MAX   具体底层程序添加                              ***
***           2007/9/16   V1.03   METAL MAX   具体底层程序添加                              ***
***           2008/5/22   V2.00   METAL MAX   修改不同驱动层文件为一个文件                  ***
***备    注： 使用本驱动库，需要添加DriverT6963.H、DriverT6963.lib以及PinDefine.h           ***                                                                              ***
**********************************************************************************************/
#ifndef _DriverT6963_H_
#define _DriverT6963_H_

/**********************************************************************************************
**函数名称： ClearScreen                                                                     **
**函数功能： 清除全屏                                                                        **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void ClearScreen  (unsigned char Mod);                     

/**********************************************************************************************
**函数名称： void InitScreen(void)                                                           **
**函数功能： 初始化LCM                                                                       **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void InitScreen   (void);                                  

/**********************************************************************************************
**函数名称： void Picture(unsigned int Addr, unsigned char Tier,                             ** 
**                        unsigned char Column, unsigned char *Dat)                          **
**函数功能： 描图                                                                            **
**入口参数： 显示区坐标X,Y,图片的长，图片的宽，图片数据首地址                                **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：   1.由于显示字节的制约且简化显示函数，图片的X坐标只能是以字节的整数倍。             **
**         2.图片不能溢出显示屏，以免造成图片回显到显示屏顶部，显示函数没有裁剪图片。        **
**		    取模图片的时候注意图片的大小。                                                   **
**********************************************************************************************/
void Picture      (unsigned char x, unsigned char y,       //图片的左上角坐标
                   unsigned char Column,                   //图片的行列数
				   unsigned char Tier,                     //
				   unsigned char *Dat);                    //图片数据指针
/**********************************************************************************************
**函数名称：	 void WriteCG()                                                              **
**函数功能：	 写内部CGRAM区                                                               **
**入口参数：	                                                                             **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void WriteCG      (unsigned int Address,                   //内部显示缓存RAM地址
                   unsigned char dat);                     //

/**********************************************************************************************
函数名称：	WriteEN(unsigned int Address, unsigned char Dat)
函数功能：	写一个英文字符
入口参数：	屏幕地址和要写入的字符
出口参数：
具体资源：
调用程序：
备注：      直接使用： WriteEN(Address, 'A')即可
**********************************************************************************************/
void WriteEN(unsigned int Address, unsigned char Dat); 

/**********************************************************************************************
**函数名称： 	void WriteCH(unsigned int Address, unsigned char *temp)                      **
**函数功能：	写一个汉字（没有采用CGROM的方式，采用直接在图形区域写值）                    **
**入口参数：	汉字左上角地址，及汉字数组的首地址                                           **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/	
void WriteCH      (unsigned int Address,                   //内部显示缓存RAM地址
                   unsigned char *temp);                   //
/**********************************************************************************************
**函数名称：	 void EasyCH(unsigned char Tier, unsigned char Column, unsigned char *temp)  **
**函数功能：	 以行列的形式给出汉字坐标                                                    **
**入口参数：	 汉字的坐标（行，列） 以及汉字点阵库地址                                     **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void EasyCH       (unsigned char Tier,                     //文字的坐标
                   unsigned char Column,                   //
				   unsigned char *temp);                   //文字字模数据

/**********************************************************************************************
函数名称：	DispStr(unsigned char *str)
函数功能：	写一个字符串
入口参数：	屏幕地址和要写入的字符串首地址
出口参数：
具体资源：
调用程序：
备注：
**********************************************************************************************/
void DispStr(unsigned int StrtAddr, unsigned char *str);


/**********************************************************************************************
**函数名称：	 BitSet                                                                      **
**函数功能：	 置位屏幕上一点                                                              **
**入口参数：	 该点的字节地址，第几位                                                      **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void BitSet(unsigned int Address, unsigned char BIT);

/**********************************************************************************************
**函数名称：	BitReset                                                                     **
**函数功能：	清除屏幕上的一点                                                             **
**入口参数：	该点的字节地址，第几位                                                       **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void BitReset(unsigned int Address, unsigned int BIT);

/**********************************************************************************************
**函数名称：	DrawPoint                                                                    **
**函数功能：	在屏幕的任何位置画一个点                                                     **
**入口参数：	该点的横坐标和纵坐标（屏幕的左上角坐标为（0，0））横向为X轴，纵向为Y轴       **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：		                                                                             **
**********************************************************************************************/
void Point(unsigned int Xp, unsigned int Yp, unsigned char Mod);

/**********************************************************************************************
**函数名称： void Line(unsigned char x1, unsigned char y1,                                   **
**                     unsigned char x2, unsigned char y2) 	                                 **
**函数功能：	 画直线函数                                                                  **
**入口参数：	 直线两端点坐标                                                              **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：		 采用BRESENHAM AL算法                                                        **
**********************************************************************************************/
void Line(int x1, int y1, int x2, int y2, unsigned char Mod);

/**********************************************************************************************
**函数名称：  void LineClr(unsigned char x1,                                                 **
**　　　　　　　　　　　　　unsigned char y1,                                                **   
**                          unsigned char x2,                                                **
**                          unsigned char y2) 	                                             **
**函数功能：	 清除一条直线函数                                                            **
**入口参数：	 直线两端点坐标                                                              **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：		 采用BRESENHAM AL算法                                                        **
**********************************************************************************************/
void LineClr(int x1, int y1, int x2, int y2);

/**********************************************************************************************
**函数名称： void DrawRectangle(unsigned char Topx, unsigned char Topy,                      **
**                              unsigned char Bottomx, unsigned char Bottomy,                **
**                              unsigned char Mod)                                           **
**函数功能：	画矩形或是填充矩形                                                           **
**入口参数：	（左上顶点、右下顶点坐标、是否填充标志）                                     **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：		 当填充标志位为0是表示画矩形框，不为0时表示填充矩形                          **
**********************************************************************************************/
void Rectangle(unsigned char Topx, unsigned char Topy, 
               unsigned char Bottomx, unsigned char Bottomy, unsigned char Mod);

/**********************************************************************************************
**函数名称：  Circle                                     	                                 **
**函数功能：  以指定的圆心和半径画圆	                                                     **
**入口参数：  圆心、半径                                                                     **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**          1.注意本画圆函数没有考虑半径过大导致图形区域溢出的情况。                         **
**		                                                                                     **
**********************************************************************************************/
void Circle( unsigned int x0, unsigned int y0, unsigned char Rand);

/**********************************************************************************************
**函数名称：  void Triangle	                                                                 **
**函数功能：  三角形                                                                         **
**入口参数：  三顶点                                                                         **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：     	                                                                             **
**                                                                                           **
**********************************************************************************************/
void Triangle(unsigned char x1, unsigned char y1, 
              unsigned char x2, unsigned char y2, 
              unsigned char x3, unsigned char y3);

/**********************************************************************************************
**函数名称：                                                                                 **
**函数功能： 有半字参数命令写                                                                **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/	
void WCIntData(unsigned char CMD, unsigned int DAT);

/**********************************************************************************************
**函数名称：                                                                                 **
**函数功能： 有字节参数命令写                                                                **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/	
void WCCharData(unsigned char CMD,unsigned char DAT);

/**********************************************************************************************
**函数名称：                                                                                 **
**函数功能：  无参数命令写                                                                   **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void WCNoData(unsigned char CMD);

/**********************************************************************************************
**函数名称：                                                                                 **
**函数功能：  底层写一字节                                                                   **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void WDCharData(unsigned char DAT);

/**********************************************************************************************
**函数名称：                                                                                 **
**函数功能： 复位LCM（与端口有关）                                                           **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/	
void LCMReset(void);

/**********************************************************************************************
**函数名称：                                                                                 **
**函数功能： 字体选择                                                                        **
**入口参数：                                                                                 **
**出口参数：                                                                                 **
**具体资源：                                                                                 **
**调用程序：                                                                                 **
**备注：                                                                                     **
**********************************************************************************************/
void FontStyle(unsigned char Style);

#endif